
## Plan Result




<pre><code>Plan: 1 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.s2s
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.disposer-vault.azurerm_key_vault.kv
  * module.disposer-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.disposer-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.disposer-vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "disposer-aat"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "disposer-aat"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/disposer-aat/providers/Microsoft.Insights/components/disposer-aat"
        name                                  = "disposer-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/disposer-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/disposer-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.s2s will be created
  + resource "azurerm_key_vault_secret" "s2s" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "s2s-secret-disposer-idam-user"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/disposer-aat"
        name     = "disposer-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/disposer-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/disposer-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.disposer-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/disposer-aat/providers/Microsoft.KeyVault/vaults/disposer-aat"
        name                            = "disposer-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/disposer-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/disposer-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.disposer-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/disposer-aat/providers/Microsoft.KeyVault/vaults/disposer-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.disposer-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/disposer-aat/providers/Microsoft.KeyVault/vaults/disposer-aat|disposer-aat"
        name                       = "disposer-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.disposer-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/disposer-aat-mi"
        name                = "disposer-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/disposer-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/disposer-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"","Vars":{}} -->